Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/c-api.tmx
Source language: en
Languages: fr

source: Convert a Python byte, represented as a :class:`bytes` object of length 1, to a C :ctype:`char`.
fr: Convertit un octet Python, représenté comme un objet :class:`bytes` de longueur 1, en un type C :ctype:`char`.

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :ctype:`int`.
fr: Convertit un caractère Python, représenté comme un objet :class:`str` de longueur 1, en un type C :ctype:`int`.

source: Convert a Python floating point number to a C :ctype:`float`.
fr: Convertit un nombre flottant Python vers un type C :ctype:`float`.

source: Convert a Python floating point number to a C :ctype:`double`.
fr: Convertit un nombre flottant Python vers un type C :ctype:`double`.

source: Convert a Python complex number to a C :ctype:`Py_complex` structure.
fr: Convertit un nombre complexe Python vers une structure C :ctype:`Py_complex`.

source: Other objects
fr: Autres objets

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. The object's reference count is not increased. The pointer stored is not *NULL*.
fr: Stocke un objet Python (sans aucune conversion) en un pointeur sur un objet C. Ainsi, Le programme C reçoit l'objet réel qui a été passé. Le compteur de référence sur l'objet n'est pas incrémenté. Le pointeur stocké n'est pas *NULL*.

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :ctype:`PyObject\*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
fr: Stocke un objet Python en pointeur sur un objet C. C'est comparable à ``O``, mais la fonction prend deux arguments C : le premier est l'adresse d'un objet de type Python, le second est l'adresse d'une variable C (de type :ctype:`P:exc:`TypeError`yObject\*`) dans laquelle le pointeur sur l'objet sera stocké. Si l'objet Python n'est pas du type requis, une exception :exc:`TypeError` sera levée.

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :ctype:`void \*`. The *converter* function in turn is called as follows::
fr: Converti un objet Python en une variable C en utilisant une fonction de *conversion*. La fonction prend deux arguments : le premier est une fonction, le second est l'adresse d'une variable C (de type arbitraire), convertie en :ctype:`void \*`. La fonction de *conversion* est appellée à son tour de la manière suivante :

source: status = converter(object, address);
fr: status = conversion(objet, adresse);

source: where *object* is the Python object to be converted and *address* is the :ctype:`void\*` argument that was passed to the :cfunc:`PyArg_Parse\*` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
fr: Où *objet* est l'objet Python à convertir et *adresse* est l'argument de type :ctype:`void\*` qui a été passé à la function :cfunc:`PyArg_Parse\*`. Le status retourné devrait être ``1`` pour conversion réussie, et ``0`` si la conversion a échouée. Quand la conversion échoue, la fonction de *conversion* devrait lever une exception et laisser le contenu de *adresse* non modifié.

source: If the *converter* returns Py_CLEANUP_SUPPORTED, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be NULL; *address* will have the same value as in the original call.
fr: Si la fonction de *conversion* retourne Py_CLEANUP_SUPPORTED, elle peut être appelée une seconde fois si l'analyse des arguments échoue, donnant ainsi à la fonction de conversion la possibilité de libérer la mémoire qu'elle avait allouée précédemment. Dans ce second appel, le paramètre correspondant à l'*objet* sera NULL; *adresse* aura la même valeur que dans le premier appel.

source: The object must be a Python sequence whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
fr: L'objet doit être une séquence Python dont la longueur est le nombre d'unités de formats dans *articles*. Les arguments C doivent correspondre à chaque unité de format particulière dans *articles*. Les unités de formats pour les séquences peuvent être imbriquées.

source: It is possible to pass "long" integers (integers whose value exceeds the platform's :const:`LONG_MAX`) however no proper range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value (actually, the semantics are inherited from downcasts in C --- your mileage may vary).
fr: Il est possible de passer des entiers de type "long" (dont la valeur dépasse le :const:`LONG_MAX` de la plateforme), cependant aucun contrôle d'intervalle n'est effectué --- les bits les plus significatifs sont tronqués silencieusement quand le champ cible est trop petit (en fait, la sémantique est héritée du transtypage en C --- la perte peut varier).

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
fr: Quelques autres caractères ont un sens dans une chaîne de format. On ne doit pas les trouvées dans des parenthèses imbriquées. Ce sont :

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :cfunc:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
fr: Incique que les arguments restants dans la liste Python des arguments sont optionels. Les variables C correspondant à ces arguments optionnels devraient être initialisés avec leur valeur par défaut --- quan un argument optionnel n'est pas spécifié, la fonction :cfunc:`PyArg_ParseTuple` ne modifie par le contenu de la ou des variables C correspondantes.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :cfunc:`PyArg_ParseTuple` raises).
fr: La liste des unités de format s'arrête ici ; la chaîne après les deux-points est utilisée comme le nom de la fonction dans les messages d'erreur (la "valeur associée" de l'exception levée par :cfunc:`PyArg_ParseTuple`).

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
fr: La liste des unités de format s'arrête ici ; la chaîne après le point-virgule est utilise comme message d'erreur *au lieu* du message d'erreur par défaut. ``:`` et ``;`` sont mutuellement exclusifs.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
fr: Notez que n'importe quelles références sur un objet Python qui sont données à l'appelant sont des références *empruntées* ; ne décrémentez pas leur compteur de références !

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
fr: Les arguments additionnels qui sont donnés à ces fonctions doivent être des adresses de variables dont le type est déterminé par la chaîine de format. Elles sont utilisées pour stocker les valeurs du n-uplet d'entrée. Il y a quelques cas, comme décrit précédemment dans le liste des unités de formats, où ces paramètres sont utilisés comme valeurs d'entrée. Dans ce cas, ils devraient correspondre à ce qui est spécifié pour l'unité de format correspondante.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the :cfunc:`PyArg_Parse\*` functions return true, otherwise they return false and raise an appropriate exception. When the :cfunc:`PyArg_Parse\*` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
fr: Pour que la conversion réussise, l'objet *arg* doit correspondre au format, et le format doit être épuisé. En cas de succès, les fonctions :cfunc:`PyArg_Parse\*` retournent vrai, sinon elles retournent faux et lèvent l'exception appropriée. Quand une fonction :cfunc:`PyArg_Parse\*` échoue en raison d'une erreur de conversion dans une des unités de format, les variables aux adresses correspondantes à cette erreur et les unités de formats suivantes sont laissées telles quelles.

source: API Functions
fr: Fonction de l'API

source: Building values
fr: Construction des valeurs

source: Boolean Objects
fr: Les objets booléens

source: Booleans in Python are implemented as a subclass of integers. There are only two booleans, :const:`Py_False` and :const:`Py_True`. As such, the normal creation and deletion functions don't apply to booleans. The following macros are available, however.
fr: Les booléens en Python sont implémentés comme une classe dérivée des entiers. Il y a seulement deux booléens, :const:`Py_False` et :const:`Py_True`. Comme tel, les fonctions de création de suppression ne s'appliquent pas aux booléens. Toutefois, les macros suivantes sont disponibles.

source: Buffer Objects
fr: Les objets tampons

source: Python objects implemented in C can export a "buffer interface." These functions can be used by an object to expose its data in a raw, byte-oriented format. Clients of the object can use the buffer interface to access the object data directly, without needing to copy it first.
fr: Les objets Python implémentés en C peuvent exporter une "interface sur des tampons". Ces fonctions peuvent être utilisées par un objets pour rendre publiques ses données, dans un format brut orienté octets. Les clients de ces objets peuvent utiliser l'interface sur les tampons pour accéder directement aux données de l'objet, sans nécessiter une copie préalable.

source: Two examples of objects that support the buffer interface are bytes and arrays. The bytes object exposes the character contents in the buffer interface's byte-oriented form. An array can also expose its contents, but it should be noted that array elements may be multi-byte values.
fr: Deux exemples d'objets qui supportent l'interfaces sur les tampons sont les octets et les tableaux. Les objets octets exposent leur contenu en tant que caractètres, dans une interface sur tampon orientée octets. Un tableau peut également exposer son contenu, mais il doit être remarqué que les éléments du tableau peuvent être des valeurs multi-octets.

source: An example user of the buffer interface is the file object's :meth:`write` method. Any object that can export a series of bytes through the buffer interface can be written to a file. There are a number of format codes to :cfunc:`PyArg_ParseTuple` that operate against an object's buffer interface, returning data from the target object.
fr: Un exemple d'utilisation de l'interface sur les tampons est la méthode :meth:`write` de l'objet fichier. Tout objet qui peut exporter une série d'octets en utilisant l'interface tampons peut être écrit dans un fichier. Il y a un nombre de codes de format pour :cfunc:`PyArg_ParseTuple` qui contredisent l'interface tampon de l'objet, en retournant les données de l'objet cible.

source: More information on the buffer interface is provided in the section :ref:`buffer-structs`, under the description for :ctype:`PyBufferProcs`.
fr: Plus d'informations sur l'interface sur les tampons sont données dans la section :ref:`buffer-structs`, dans la description sur :ctype:`PyBufferProcs`.

source: Buffer objects are useful as a way to expose the data from another object's buffer interface to the Python programmer. They can also be used as a zero-copy slicing mechanism. Using their ability to reference a block of memory, it is possible to expose any data to the Python programmer quite easily. The memory could be a large, constant array in a C extension, it could be a raw block of memory for manipulation before passing to an operating system library, or it could be used to pass around structured data in its native, in-memory format.
fr: Les objets tampons sont utiles pour exposer les données d'une autre interface d'un objet tampon au développeur Python. Ils peuvent aussi être utilisés comme un mécanisme de découpage sans copie. En utilisant leur capacité à référencer un bloc de mémoire, il est possible d'exposer n'importe quelle donnée au développeur Python assez simplement. La mémoire peut ainsi être un tableau constant de grande taille d'une extension en C, elle peut être un bloc mémoire destiné à être modifié avant de le passer à une librairie système, ou encore elle peut permettre de faire passer des données structurées dans leur format originel en mémoire.

source: Buffer related functions
fr: Fonctions relatives aux tampons

source: MemoryView objects
fr: Objets de type MemoryView

source: A memoryview object exposes the C level buffer interface to Python.
fr: Un objet MemoryView expose l'interface tampon au niveau C à Python.

source: Byte Array Objects
fr: Objets Tableau d'Octets

source: Type check macros
fr: Macros de vérification de type

source: Direct API functions
fr: Fonctions directes sur l'API

source: These macros trade safety for speed and they don't check pointers.
fr: Ces macros sont taillées pour la vitesse d'exécution et ne vérifient pas les pointeurs.

source: Bytes Objects
fr: Objets bytes

source: These functions raise :exc:`TypeError` when expecting a bytes parameter and are called with a non-bytes parameter.
fr: Ces fonctions lèvent :exc:`TypeError` lorsqu'elles attendent un paramètre de type octets et qu'elles sont appelées avec un paramètre qui n'est pas un octet.

source: Refer to :ref:`using-capsules` for more information on using these objects.
fr: Reportez-vous à :ref:`using-capsules` pour plus d'informations sur l'utilisation de ces objets.

source: Cell Objects
fr: Objets Cellules

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
fr: Les objets "Cellules" sont utilisés pour implémenter des variables référencées dans de multiples enviromments. Pour chacune de ces variables, un objet cellule est créé pour stocker sa valeur ; les variables locales de chaque pile d'exécution qui référence cette valeur contiennent une référence sur les cellules des autres environnements qui utilisent aussi cette variable. Quand la valeur est accédée, la valeur de la cellule est utilisée, au lei de celle de l'objet cellule proprement dit. Ce dé-référencement de l'objet cellule requiert l'intervention du bytecode généré ; il n'est pas automatiquement dé-référencé quand il est accédé. Il est plausible que les objets cellules ne soit utilisés ailleurs.

source: Code Objects
fr: Objets Code

source: Code objects are a low-level detail of the CPython implementation. Each one represents a chunk of executable code that hasn't yet been bound into a function.
fr: Les objets Code sont un détail bas-niveau de l'implémentation CPython. Chacun d'eux représente une partie de code exécutable, qui n'a pas encore été lié dans une fonction.

source: Complex Number Objects
fr: Objets Nombres Complexes

source: Python's complex number objects are implemented as two distinct types when viewed from the C API: one is the Python object exposed to Python programs, and the other is a C structure which represents the actual complex number value. The API provides functions for working with both.
fr: Les objets Python nombres complexes sont implémentés comme deux types distincts, lorsqu'ils sont vus de l'API C : l'un est l'objet Python tel qu'il est vu par les programmes Python, et l'autre est une structure C qui représente la valeur complexe courante. L'API fournit des fonctions pour travailler avec ces deux représentations.

source: Complex Numbers as C Structures
fr: Nombres complexes en tant que structures C

source: Note that the functions which accept these structures as parameters and return them as results do so *by value* rather than dereferencing them through pointers. This is consistent throughout the API.
fr: Remarquez que les fonctions qui acceptent ces structures comme paramètres et les retournent comme résultats le font *par valeur* au lieur de les dé-référencer en utilisant des pointeurs. Cela est constant dans toute l'API.

source: Complex Numbers as Python Objects
fr: Nombres complexes en tant qu'objets Python

source: Concrete Objects Layer
fr: Couche des Objets Concrets

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :cfunc:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
fr: Les fonctions dans ce chapitre sont spécifiques à certains types d'objets Python. Leur donner un objet d'un mauvais type n'est pas une bonne idée. Si vous recevez un objet d'un programme Python et que vous n'êtes pas sûr qu'il est du bon type, vous devez tout d'abord vérifier son type. Par exemple, pour vérifier qu'un objet est un dictionnaire, utiliser :cfunc:`PyDict_Check`. Ce chapitre est structuré comme un "arbre des familles" des types d'objets Python.

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for *NULL* being passed instead of a valid object. Allowing *NULL* to be passed in can cause memory access violations and immediate termination of the interpreter.
fr: Tandis que les fonctions décrites dans ce chapitre vérifient avec soin le type des objets qui leur sont passés, beaucoup d'entre elles ne vérifient pas que *NULL* est passé au lieu d'un objet valide. Autoriser *NULL* à être passé peut provoquer des violations d'accès à la mémoire et ainsi terminer immédiatement l'interpréteur.

source: Fundamental Objects
fr: Objets fondamentaux

source: This section describes Python type objects and the singleton object ``None``.
fr: Cette section décrit les objets de type Python et l'objet singleton ``None``.

source: Numeric Objects
fr: Objets numériques

source: Sequence Objects
fr: Objets séquences

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
fr: Les opérations génériques sur les objets séquences ont été discutées dans le chapitre précédent. Cette section traite des genres spécifiques d'objets séquences qui sont intrinsèques au langage Python.

source: Mapping Objects
fr: Objets association

source: Other Objects
fr: Autres Objets

source: String conversion and formatting
fr: Conversion et formatage de chaînes

source: Functions for number conversion and formatted string output.
fr: Fonctions de conversion pour les nombres et pour la sortie des chaînes formattées.

source: DateTime Objects
fr: Objets DateTime

source: Dictionary Objects
fr: Objets dictionnaires

source: Exception Handling
fr: Gestion des exceptions

source: Exception Objects
fr: Objets Exception

source: Recursion Control
fr: Contrôle de la récursion

source: Standard Exceptions
fr: Exceptions standards

source: C Name
fr: Nom C

source: Python Name
fr: Nom Python

source: This is a base class for other standard exceptions.
fr: C'est la classe de base pour les autres exceptions standards

source: This is the same as :exc:`weakref.ReferenceError`.
fr: Identique à :exc:`weakref.ReferenceError`.

source: File Objects
fr: Objets fichiers

source: Advanced Debugger Support
fr: Support avancé du debugger

source: Utilities
fr: Utilitaires
